---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.MepSpotTopElevation
source: html/6b8ccdee-16a3-3647-2f15-2b2fe569e669.htm
---
# Autodesk.Revit.DB.ParameterTypeId.MepSpotTopElevation Property

"Spot Top Elevation": used for both design and fabrication components

## Syntax (C#)
```csharp
public static ForgeTypeId MepSpotTopElevation { get; }
```